
[
  {
    "author": "Sarah L.",
    "rating": 5,
    "time": "2024-08-15",
    "text": "TQM Digital completely transformed our online presence. Their team delivered a website that is not only beautiful but also incredibly fast. Our leads have doubled since launch. Highly recommend their services!",
    "profileUrl": "https://g.page/r/YOUR_PLACE_ID",
    "source": "Google"
  },
  {
    "author": "Michael B.",
    "rating": 5,
    "time": "2024-07-22",
    "text": "The redesign process was seamless and professional. They listened to our needs and created a site that perfectly reflects our brand and has significantly improved our user engagement.",
    "profileUrl": "https://g.page/r/YOUR_PLACE_ID",
    "source": "Google"
  },
  {
    "author": "Jessica P.",
    "rating": 5,
    "time": "2024-06-30",
    "text": "An outstanding agency to work with. The attention to detail in our website's performance and SEO foundation was impressive. We're already seeing a great return on our investment.",
    "profileUrl": "https://g.page/r/YOUR_PLACE_ID",
    "source": "Google"
  },
  {
    "author": "David C.",
    "rating": 5,
    "time": "2024-05-18",
    "text": "Very happy with the final product. The website is modern, easy to navigate, and our Core Web Vitals have never been better. The project took a bit longer than expected but the quality was worth the wait.",
    "profileUrl": "https://g.page/r/YOUR_PLACE_ID",
    "source": "Google"
  },
  {
    "author": "Emily R.",
    "rating": 5,
    "time": "2024-04-25",
    "text": "If you want a website that actually generates business, go with TQM. Their focus on conversion rate optimization is a game-changer. Our previous site was just a brochure; this one is a sales machine.",
    "profileUrl": "https://g.page/r/YOUR_PLACE_ID",
    "source": "Google"
  },
  {
    "author": "Kevin S.",
    "rating": 5,
    "time": "2024-03-12",
    "text": "Professional, knowledgeable, and delivered on every promise. Our new e-commerce site is faster and converts better than our old one on a much more expensive platform.",
    "profileUrl": "https://g.page/r/YOUR_PLACE_ID",
    "source": "Google"
  },
  {
    "author": "Amanda T.",
    "rating": 5,
    "time": "2024-02-08",
    "text": "The team at TQM Digital is fantastic. They provided a clear strategy and executed it flawlessly. We're thrilled with the results and the positive feedback from our customers.",
    "profileUrl": "https://g.page/r/YOUR_PLACE_ID",
    "source": "Google"
  },
  {
    "author": "Brian H.",
    "rating": 5,
    "time": "2024-01-19",
    "text": "Their SEO and web design services work together perfectly. We saw a noticeable increase in organic traffic within a month of our new site going live. A truly integrated approach.",
    "profileUrl": "https://g.page/r/YOUR_PLACE_ID",
    "source": "Google"
  },
  {
    "author": "Laura W.",
    "rating": 5,
    "time": "2023-12-21",
    "text": "A top-notch agency that delivers tangible results. Our website's load speed is phenomenal, and the user experience has received nothing but praise.",
    "profileUrl": "https://g.page/r/YOUR_PLACE_ID",
    "source": "Google"
  },
  {
    "author": "Steven M.",
    "rating": 5,
    "time": "2023-11-05",
    "text": "Solid work from the TQM team. The new website is a huge improvement. Communication was good throughout the project.",
    "profileUrl": "https://g.page/r/YOUR_PLACE_ID",
    "source": "Google"
  },
  {
    "author": "Rachel G.",
    "rating": 5,
    "time": "2023-10-14",
    "text": "We were struggling with low conversion rates, and TQM's redesign fixed that. Their data-driven approach identified all the friction points in our user journey. Fantastic outcome.",
    "profileUrl": "https://g.page/r/YOUR_PLACE_ID",
    "source": "Google"
  },
  {
    "author": "Chris J.",
    "rating": 5,
    "time": "2023-09-28",
    "text": "The best web design agency we've ever worked with. They understand the technical side of performance just as well as the creative side of branding. A rare combination.",
    "profileUrl": "https://g.page/r/YOUR_PLACE_ID",
    "source": "Google"
  },
  {
    "author": "Megan F.",
    "rating": 5,
    "time": "2023-08-11",
    "text": "Our old website was slow and outdated. TQM gave us a fresh, modern design that's lightning-fast and mobile-friendly. The difference in user feedback has been night and day.",
    "profileUrl": "https://g.page/r/YOUR_PLACE_ID",
    "source": "Google"
  },
  {
    "author": "Jason K.",
    "rating": 5,
    "time": "2023-07-16",
    "text": "Exceptional service and a fantastic result. Our site is now a true asset to our business, driving leads and supporting our sales team effectively.",
    "profileUrl": "https://g.page/r/YOUR_PLACE_ID",
    "source": "Google"
  },
  {
    "author": "Nicole D.",
    "rating": 5,
    "time": "2023-06-20",
    "text": "The team was responsive, creative, and focused on our business goals. They built us a custom solution that exceeded our expectations. Highly recommended for any business looking to grow.",
    "profileUrl": "https://g.page/r/YOUR_PLACE_ID",
    "source": "Google"
  },
  {
    "author": "Daniel P.",
    "rating": 5,
    "time": "2023-05-09",
    "text": "Our website looks incredible and performs even better. The project was managed efficiently, and the communication was excellent from start to finish.",
    "profileUrl": "https://g.page/r/YOUR_PLACE_ID",
    "source": "Google"
  },
  {
    "author": "Olivia A.",
    "rating": 5,
    "time": "2023-04-18",
    "text": "A great experience overall. The new site is a massive upgrade and has made a positive impact on our brand perception.",
    "profileUrl": "https://g.page/r/YOUR_PLACE_ID",
    "source": "Google"
  },
  {
    "author": "William E.",
    "rating": 5,
    "time": "2023-03-22",
    "text": "TQM's strategic approach to web design sets them apart. They took the time to understand our customers and built a site that speaks directly to them. The results speak for themselves.",
    "profileUrl": "https://g.page/r/YOUR_PLACE_ID",
    "source": "Google"
  },
  {
    "author": "Sophia N.",
    "rating": 5,
    "time": "2023-02-14",
    "text": "We are extremely pleased with our new website. It is professional, fast, and has all the functionality we need to scale our operations online.",
    "profileUrl": "https://g.page/r/YOUR_PLACE_ID",
    "source": "Google"
  },
  {
    "author": "James W.",
    "rating": 5,
    "time": "2023-01-05",
    "text": "A pleasure to work with this talented team. They are experts in their field and delivered a website that is helping us achieve our business objectives. Worth every penny.",
    "profileUrl": "https://g.page/r/YOUR_PLACE_ID",
    "source": "Google"
  }
]
